<script setup>
const str = '# 关键帧社区规范\n' +
    '更新时间：**2024年12月17日**\n' +
    '生效时间：**2024年12月24日**\n' +
    '\n' +
    '亲爱的小小帧们，欢迎来到关键帧！为打造真实、向上、多元的社区氛围，希望小小帧们可以遵守规范，共同维护我们的社区环境。\n' +
    '\n' +
    '## 一、价值观\n' +
    '关键帧倡导用户发布符合当代社会主流价值观的内容。\n' +
    '1. **遵守宪法和法律法规**\n' +
    '2. **践行社会主义核心价值观**\n' +
    '3. **弘扬爱国主义、集体主义和社会主义**\n' +
    '4. **传播正确的历史观、民族观、国家观和文化观**\n' +
    '5. **弘扬中华民族优秀传统文化**\n' +
    '6. **弘扬社会公德、职业道德、家庭和个人美德，尊重公序良俗**\n' +
    '7. **弘扬科学精神、普及科学知识**\n' +
    '8. **提倡积极健康向上的时代风尚和生活方式**\n' +
    '\n' +
    '## 二、法律法规\n' +
    '关键帧对于社区内违反法律法规、危害国家及社会安全的行为，将采用最严格的管理办法，予以杜绝。\n' +
    '1. **遵守基本准则**\n' +
    '关键帧平台禁止发布和传播包含下列信息的内容：\n' +
    '    - 违反宪法所确定的基本原则的\n' +
    '    - 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的\n' +
    '    - 损害国家荣誉和利益的，如损害国旗国徽形象的\n' +
    '    - 煽动民族仇恨、民族歧视，破坏民族团结的\n' +
    '    - 破坏国家宗教政策，宣扬邪教和封建迷信的\n' +
    '    - 散布谣言，扰乱社会秩序，破坏社会稳定的\n' +
    '    - 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的\n' +
    '    - 侮辱或者诽谤他人，侵害他人合法权益的\n' +
    '    - 宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的\n' +
    '    - 侮辱滥用英烈形象，否定歪曲英烈事迹，美化或粉饰侵略者和侵略战争行为的\n' +
    '    - 攻击诋毁党和国家领导人，捏造领导人负面信息，滥用领导人形象的\n' +
    '    - 违背公序良俗的内容，如低俗婚闹等\n' +
    '    - 含有法律、行政法规禁止的其他内容的\n' +
    '2. **保护未成年人合法权益**\n' +
    '为更好地承担保护未成年人合法权益的社会责任，关键帧平台设立青少年模式。在该模式下限制浏览内容和使用时长、禁止直播打赏和充值功能；制定了涉未成年人内容管理规范，对其他不利于未成年人身心健康的内容加以严肃处理，包括但不限于以下内容：\n' +
    '    - 涉及未成年人色情低俗的，如展示未成年人婚育、性侵害等\n' +
    '    - 涉及未成年人暴力欺凌的，如施暴犯罪、残害体罚、校园欺凌等\n' +
    '    - 涉及披露未成年人隐私的，如展示未成年人性器官，公开个人隐私等\n' +
    '    - 涉及未成年人不良行为的，如宗教传授、饮酒吸烟、邪典动画等\n' +
    '    - 涉及规避未成年人系统监管的，如故意规避防沉迷、青少年模式的方法攻略\n' +
    '    - 其他危害未成年人安全和健康的相关内容\n' +
    '3. **抵制一切违法信息**\n' +
    '    - 禁止传播违法内容涉及违禁物品，包括但不限于：毒品、违禁药物、违法工具等，如大麻、鸦片、处方药物、投资理财产品、假币、枪支、烟草、爆炸物、翻墙软件、外挂程序等其他内容。涉及违禁活动，包括但不限于：有关传销、胎儿性别鉴定、售卖假货等其他内容\n' +
    '    - 禁止发布欺诈或赌博信息，发布欺诈信息，如假冒官方客服、正规网站，以短信、站内私信或链接等形式提示虚假中奖信息，设计“杀猪盘”类欺诈行为等。提供赌博交易平台信息或赌博性质类服务，如赌博平台链接、币商、中介、游戏币回收等。涉及赌博技巧、赌博器具等赌博内容，如老虎机、透视扑克等\n' +
    '4. **抵制一切色情低俗内容**\n' +
    '禁止发布、传播的信息包括但不限于：\n' +
    '    - 直接暴露和描写人体性部位的内容\n' +
    '    - 表现或隐晦表现性行为、具有挑逗性或者侮辱性的内容\n' +
    '    - 以带有性暗示、性挑逗的语言描述性行为、性过程、性方式的内容\n' +
    '    - 全身或者隐私部位未着衣物，仅用肢体掩盖隐私部位的内容\n' +
    '    - 带有侵犯个人隐私性质的走光、偷拍、漏点等内容\n' +
    '    - 以庸俗和挑逗性标题吸引点击的内容\n' +
    '    - 相关部门禁止传播的色情和有伤社会风化的文字、音视频内容，包括一些电影的删节片段\n' +
    '    - 传播一夜情、换妻、性虐待等的有害信息\n' +
    '    - 情色动漫、小说\n' +
    '    - 宣扬暴力、恶意谩骂、侮辱他人等的内容\n' +
    '    - 非法的性药品广告和性病治疗广告等相关内容\n' +
    '    - 恶意传播侵害他人隐私的内容\n' +
    '    - 推介淫秽色情网站和网上低俗信息的链接、图片、文字等内容\n' +
    '\n' +
    '## 三、交易及导流行为\n' +
    '关键帧禁止侵害消费者合法权益或扰乱市场秩序的销售行为，禁止售卖高风险类内容，且不鼓励发布营销或导流的信息，包括但不限于以下内容：\n' +
    '1. **交易行为**\n' +
    '    - 侵害消费者合法权益的行为，如假冒伪劣商品、侵害他人账户财务、恶意骚扰等\n' +
    '    - 扰乱市场秩序的行为，如虚假宣传、虚假交易、价格欺诈、侵犯知识产权等\n' +
    '    - 发布售卖高风险类的相关内容，如医美整形、医疗器械等\n' +
    '    - 发布其他具有营销倾向的内容，如代购、转卖、拼单等\n' +
    '2. **导流行为**\n' +
    '    - 发布导流到个人的联系方式，如手机号、微信号、邮箱、地址等\n' +
    '    - 发布导流到其他平台的联系方式，如网址链接、二维码、水印等\n' +
    '\n' +
    '## 四、不当行为\n' +
    '关键帧不鼓励发布不友好、欺骗或危险行为的内容，禁止任何作弊信息及行为，包括但不限于以下内容：\n' +
    '1. **不友好/不合适的内容**\n' +
    '    - 发布含人身攻击、骚扰他人的内容，如辱骂、侮辱、恶意引战、故意骚扰等\n' +
    '    - 发布含不文明的行为，如禁烟场所吸烟、妨碍导盲犬、随地吐痰等\n' +
    '    - 发布严重影响用户体验的内容，如首图血腥恐怖、标题党、图文不符等\n' +
    '    - 分享的产品和内容无相关性、无真实体验经历、未还原真实感受、过分参照商家指引或使用过多官方宣传语句\n' +
    '    - 发布其他不符合大众审美的内容\n' +
    '2. **欺骗行为**\n' +
    '    - 编造公众人物的社会谣言，如绝症、去世或其他有违事实的信息\n' +
    '    - 发布违背科学常识的内容，如在食品安全、健康养生等领域发布已被官方或权威机构辟谣的内容\n' +
    '3. **危险行为**\n' +
    '    - 易引人模仿的危险行为，如危险驾驶车辆，不当使用明火、干扰电梯等\n' +
    '    - 无安全提示、无防护措施的危险行为，如无提示的极限运动、无防护措施的高空行为等\n' +
    '4. **作弊行为**\n' +
    '    - 恶意注册账号。如批量注册等\n' +
    '    - 滥用权益注册或开设多个账号，开展如破坏、干扰关键帧平台秩序等的不当行为\n' +
    '    - 非正常模式地发布笔记，如批量发布、高频发布、机器发布等\n' +
    '    - 通过程序、脚本模拟、人刷或其他非正常手段、方法，产生虚假数据，如虚假的粉丝关注、点赞、收藏、评论等\n' +
    '    - 自行或通过第三方来谋取不正当利益、损害他人权益或干扰关键帧平台正常运行的行为，如恶意陷害、恶意举报等\n' +
    '    - 其他破坏关键帧平台秩序，影响关键帧平台公平性、真实性或造成其他不利于生态健康发展的情形\n' +
    '\n' +
    '## 五、侵权行为\n' +
    '关键帧禁止一切侵犯他人合法权益的行为，如模仿冒充、抄袭搬运，包括但不限于以下内容：\n' +
    '1. **姓名权、肖像权、名誉权及隐私权**\n' +
    '    - 未经授权使用信息，冒充他人注册账号或使用他人名称、头像等\n' +
    '    - 通过发布不实言论，散播虚假信息，损害他人名誉、商誉的内容，如他人的感情生活、商业负面等\n' +
    '    - 未经授权发布他人身份证号码、家庭住址、病史、财产信用状况等个人隐私资料\n' +
    '2. **知识产权及其他权利**\n' +
    '    - 未经他人授权，发布内容侵犯他人著作权权益，如视频，照片，图文等\n' +
    '    - 侵犯他人已经登记注册的企业名称、商标、商号、商品装潢等\n' +
    '    - 未经他人授权，发布内容侵犯他人专利权权益，如许诺销售等\n' +
    '    - 未经授权披露商业机密或其他保密信息的内容\n' +
    '    - 发布内容用以蓄意传播假冒伪劣商品信息\n' +
    '\n' +
    '## 六、违规处理\n' +
    '1. **认定标准**\n' +
    '符合下述任一的，可认定用户违规：\n' +
    '    - 人工排查发现违反本规范情形的\n' +
    '    - 关键帧算法系统对一定周期内的数据进行排查后，抓取到异常数据的\n' +
    '2. **违规处理措施**\n' +
    '关键帧会基于其独立认定的事实（违规性质、严重程度等，下同），独立确定采取如下一项或几项处理措施的组合：\n' +
    '    - 内容处理：扣除作弊数据、限制展示范围、禁止展示、依法追究法律责任\n' +
    '    - 账号处理：限制账号功能，如：作弊账号无法申请为创作者、限制展示范围、账号禁言、账号封禁、依法追究法律责任\n' +
    '\n' +
    '## 七、友情链接\n' +
    '1. **社区公约**：《关键帧社区公约》\n' +
    '2. **商业推广笔记**：《推广笔记社区规范》\n' +
    '\n' +
    '当小小帧违反社区规范，关键帧平台将对违规内容和用户做相应处理及通知。对处理结果有任何异议，均可通过APP - 帮助与客服 - 笔记/账号申诉进行反馈。\n' +
    '\n' +
    '同时，维护社区环境离不开各位小小帧的共同努力，我们欢迎小小帧们对任何可能违规的内容进行一键举报。\n' +
    '\n' +
    '关键帧平台将根据法律法规和社区管理经验，不断调整和修改社区规范。为维护社区良好氛围，任何有违社区规范或扰乱社区生态秩序的行为，平台有权依据社区规范进行处理。'
</script>

<template>
  <div id="doc"
       style="width: 100vw; height: calc(100vh);position: absolute;top: 0;left: 0;right: 0;bottom: 0;overflow-y: scroll">
    <v-md-preview :text="str"></v-md-preview>
    <a-back-top target-container="#doc" :style="{position:'absolute'}"/>
  </div>
</template>

<style scoped>

</style>